OpenFOAM-v2112/tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0 // Air
);

regions
(
    boxToCell
    {
        box (-20 -20 -1) (20 0 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1 // Water
        );
    }
);


// ************************************************************************* //